import { Routes, Route } from 'react-router-dom';
import HomePage from './pages/HomePage';
import DetailPage from './pages/DetailPage';

export default function App() {
  return (
    <Routes>
      <Route path="/" element={<HomePage />} />
      <Route
        path="/about"
        element={
          <DetailPage
            title="ליידי סטייל"
            imageSeed="about-page"
            text={[
              `אז איך זה עובד? באוירה רגועה אצלך בסלון או אצלי בסטודיו נלמד יחד: אחרי שיחת התאמה`,
              `❣️לימוד סלסה LA / קובנית`,
              `❣️פירוקי גוף ותנועות מסוגי ריקודים שונים אשר אפשר לשלב אחר כך בכל ריקוד שתרצי.`,
              `❣️אם את כבר רוקדת ורוצה לשפר ביצועים זה הזמן והמקום`,
              `❣️בצאטה -תנועות בסיס`
            ]}
          />
        }
      />
      <Route
        path="/private-lessons"
        element={
          <DetailPage
            title="לימוד ריקוד לגברים"
            imageSeed="private-lessons"
            text={[
              `אז איך זה עובד? באוירה רגועה אצלך בסלון או אצלי בסטודיו נלמד יחד: אחרי שיחת התאמה`,
              `❣️לימוד סלסה LA / קובנית`,
              `❣️תנועות נכונות בריקוד ודגשים שמתאימים להובלה של גבר.`,
              `❣️רכישת בטחון עצמי ובטחון ברחבת ריקודים `,
              `❣️סטיילינג ופירוקי גוף`
            ]}
          />
        }
      />
      <Route
        path="/group-lessons"
        element={
          <DetailPage
            title="ריקוד זוגות"
            imageSeed="group-lessons"
            text={[
              `מה מחכה לכם ?בסלון שלכם או אצלי בסטודיו באוירה רגועה ואינטימית תרכשו`,
              `❣️חוויה מטורפת של חיבור אחד לשני בריקוד ואינטימיות שתלווה אתכם גם בחיי היומיום (תתחילו לרקוד ביחד בכל מקום)`,
              `❣️זמן אכות רק שלכם`,
              `❣️שיפור קורדינציה זוגית`,
              `❣️שיפור בטחון עצמי`,
              `❣️ידע בריקוד שתוכלו ליישם גם במועדונים ובכל מקום שתרצו`,
              `❣️מתאים גם למי שלא רקד אף פעם🙏`,
            ]}
          />
        }
      />
      <Route
        path="/schedule"
        element={
          <DetailPage
            title="לו״ז ושעות"
            imageSeed="schedule-page"
            text="כאן אפשר להציג מערכת שעות, ימים קבועים, סטודיו, שיעורי ניסיון ואירועים מיוחדים."
          />
        }
      />
      <Route
        path="/contact"
        element={
          <DetailPage
            title="יצירת קשר"
            imageSeed="contact-page"
            text={[`נכון שכבר מזמן חשבתם שהגיע הזמן ללמוד לזוז נכון יותר וללמוד לרקוד כך שתוכלו להתאים את עצמכם לכל מקום בו רוקדים?`,
                  `אתם זוג שרוצים לתת פוש חדש לאינטימיות שלכם? אתה מרגיש מרובע ברחבת ריקודים ומתבייש להזמין בנות לרקוד?`,
                 `את רוצה ללמוד להניע את הגוף שלך בצורה סקסית או לשפר כישורי ליידי סטייל שלך? אז הגעת למקום הנכון!!`,
                 `אני מלמדת לרקוד מ0 למי שלא יודע בכלל ומשפרת ביצועים למי שכבר למד. בקצב שלך ,בלי לחץ, באופן פרטי אצלי בסטודיו או אצלך בבית🥰כן כן מגיעה עד לבית הלקוח.`,
                 `וכמובן עלי- אני רקדנית סלסה מקצועית.השתלמתי ולמדתי אצל מיטב המורים בארץ ובחול והריקוד זורם לי בורידים והחלטתי להנגיש את הריקוד למי שרוצה ללמוד בדרך קצת`,
                 `אחרת רכה רגועה ועדינה עם יחס אישי ודגשים הניתנים בצורה מקצועית.צעד אחר צעד נלמד לנוע בקצב ולהיפתח לאהבת ריקוד אינסופית שתוציא אותך עם בטחון עצמי בגוף שלך`
                ]}
          />
        }
      />
    </Routes>
  );
}
